/**********************718创新实验室开发板例程*********************
*  编写：718创新实验室
*  平台：STM32F103VET6
*  说明：由于作者的水平有限，若有不足之处，还请大家谅解。
*		 建议大家多看看数据手册。     
******************************************************************/


/*************************功能说明********************************
*通过三路PWM控制舵机
*TIM2/5 通道2， PA1
*TIM2/5 通道3， PA2
*************************功能说明********************************/

#include "stm32f10x.h"
#include "delay.h"
#include "Servo.h"

int main()
{
	delay_init();	//延时初始化
	TIM_PWM_Init();	//定时器PWM初始化
	
	
	while(1)
	{
		
		Servo_open();
		delay_ms(1000);
		Servo_close();
		delay_ms(1000);
	}
	
}

